{
  "id": "1905941630445601040",
  "url": "https://x.com/KynixXBT/status/1905941630445601040",
  "timestamp": "2025-12-29T11:14:30.000Z",
  "capturedAt": "2025-12-29T17:58:21.000Z",
  "author": "Kynix @KynixXBT",
  "authorName": "Kynix",
  "authorHandle": "@KynixXBT",
  "text": "Just came across a video of @blackmagicmodel and it honestly blew my mind.\n\nNot because of his size (which is seriously impressive) but because of the the interactions he had with women at events where he was booked as entertainment.\n\nThese women (mostly married!) are very eager to grab and play with his genital even in front of their families. \n\nThe reasons this was shocking to me are the following:\n\n1. His face is not objectively attracted (more like average) in the „blackpill“ facial harmony sense\n2. I expected the women to have higher inhibition especially around their relatives + in front of a camera when they probably know this will end up on the internet\n\nAt least a few of these events were bachelorette parties. Imagine you are about to marry the woman you have worked is hard for, and the day before your marriage, as she steps into her rented limousine with her friends, you see Black Magic sitting in the back of the car.\n\nBrutal.\n\nThe marriage is likely already doomed at this point. If this happens, your wife does not respect you, does not desire you and is not attracted to you. She simply views you as an oofy-doofy betabux whom she had to settle for. You will end up in a cold marriage and dead bedroom for a few years until she ultimately divorces you, takes half of your net worth + a guarantee of alimony and child support.\n\nIf divorce courts are the grim reaper of betabux marriages, then Black Magic is the harbinger. Once you see him in the back of the limousine it is already over.",
  "avatar": "kynixxbt/avatar/avatar.jpg",
  "avatarPath": "kynixxbt/avatar/avatar.jpg",
  "images": [
    "media/blackmagicreaper.png"
  ],
  "jsonFile": "kynixxbt/tweets/blackmagic/tweet.json",
  "mediaDir": "media",
  "userSlug": "kynixxbt"
}